In [1]:
import sys; sys.path.append('../')
import pandas as pd

from clean.gretna_pd import clean

In [2]:
df = clean()
df

,rank_desc,annual_salary,first_name,middle_name,last_name,middle_initial,hire_year,hire_month,hire_day,data_production_year,agency,uid
0,deputy chief (d.),100754.61,anthony,,christiana,,1983,4,11,2018,Gretna PD,6ce83f306c9f6e30070391860ce7e1ed
1,captain,88844.60,russell,,lloyd,,1983,4,11,2018,Gretna PD,bc74e0ebd9b856c77bfa2592a160a09b
2,captain,77144.08,jarvis,,jackson,,1985,1,30,2018,Gretna PD,fd09f3b93f0c1b3d9cdcc57e6b9d7793
3,captain,40163.37,eric,,covell,,1986,10,11,2018,Gretna PD,4aaa3f20df8ba60e250fce10fb337249
4,officer,22632.79,lila,,deblanc,,1987,4,20,2018,Gretna PD,4e4d248ea55513762d55521c17ba8aa2
...,...,...,...,...,...,...,...,...,...,...,...,...
105,officer,19071.06,nicholas,,pitre,,2018,1,26,2018,Gretna PD,0c97f808a36c2fc1ebbdb1ee309a8278
106,officer,24579.89,michael,,cash,,2018,5,3,2018,Gretna PD,529ed1daf06c06c83b783009880b40e8
107,officer,21228.80,danny,,ellis,,2018,5,3,2018,Gretna PD,277e24f46bfc855cb1ffc63dcc6c96fd
108,officer,9934.59,douglas,,henderson,,2018,5,3,2018,Gretna PD,5c7d50149e6e5fa68c7ec5304f6f3b5f
109,officer,21555.45,brandon,,macheca,,2018,5,3,2018,Gretna PD,fc89024ff743b779c485cce5370adea8

In [3]:
df[df.uid.duplicated(keep=False)]

Empty DataFrame
Columns: [rank_desc, annual_salary, first_name, middle_name, last_name, middle_initial, hire_year, hire_month, hire_day, data_production_year, agency, uid]
Index: []